app/controllers/pictures_controller.rb

SELECT "pictures".* FROM "pictures"  ORDER BY created_at DESC
---
	def index
		@pictures = Picture.all.order("created_at DESC")

INSERT INTO "pictures" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test"], ["description", "test"], ["created_at", "2015-10-23 01:46:53.273220"], ["updated_at", "2015-10-23 01:46:53.273220"]]
---
	def create
		@picture = Picture.new(picture_params)

		if @picture.save

UPDATE "pictures" SET "description" = ?, "updated_at" = ? WHERE "pictures"."id" = ?  [["description", "random"], ["updated_at", "2015-10-23 02:07:02.691252"], ["id", 2]]
---
	def update
		if @picture.update(picture_params)

DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 2]]
---
	def destroy
		@picture.destroy

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", 2]]
---
	def find_picture
		@picture = Picture.find(params[:id])